
import BlackTitle from '@/app/ui/title/BlackTitle';
import Link from 'next/link';
import ImageCard from '@/app/ui/cards/ImageCard.jsx';
import pic1 from '@/public/history/pic1.jpg';
import pic2 from '@/public/history/pic2.jpg';
import pic3 from '@/public/history/pic3.jpg';
import pic4 from '@/public/history/pic4.jpg';
import pic5 from '@/public/history/pic5.jpg';
import pic6 from '@/public/history/pic6.jpg';
import picTralley1 from '@/public/history/pictralley1.jpg';
import picTralley2 from '@/public/history/pictralley2.jpg';
import picTralley3 from '@/public/history/pictralley3.jpg';
import picTralley4 from '@/public/history/pictralley4.jpg';
import picTralley5 from '@/public/history/pictralley5.jpg';
import picTralley6 from '@/public/history/pictralley6.jpg';
import picTralley7 from '@/public/history/pictralley7.jpg';
import picTralley8 from '@/public/history/pictralley8.JPG';

export const metadata = {
    title: 'Історія підприємства КП ММР “МИКОЛАЇВЕЛЕКТРОТРАНС”',
    description: 'Історія підприємства КП ММР “МИКОЛАЇВЕЛЕКТРОТРАНС” (адреса, графік прийому громадян)',
  }
const textTram = [
    [
        'Третього січня 1915 року у Миколаєві пустили перший трамвай на електричній тязі. До кінця 1915 року в місті було чотири трамвайні маршрути.',
        'У 1915 році загальна довжина трамвайних колій склала 17 верст 125 сажнів (18 км 400 м). На лінії виходили від 31-го до 38-ми вагонів.',
    ],
    [
        'На початку XX сторіччя Соборна вулиця була проїзною і по ній їздили трамваї. Тому у 1914 році на Базарній площі збудували трансформаторну підстанцію для трамваїв. Будівля станом на 3 січня 2024 року збереглася, хоча і змінювала кілька разів своє призначення.'
    ],
    [
        'Під час подій 1917 року Миколаїв залишився без електропостачання. Німецька окупація, громадянська війна змусили надовго забути про трамвай. Роботу електричного транспорту відновили у 1925 році.',
        `Маршрути «Кузнецька — Привоз» та «Привоз — Спаськ» об'єднали в один й змінили нумерацію маршрутів.`,
        'У 1927 році у Миколаєві діяло лише два маршрути «Кузнецька — Спаськ» та «Каботажка — Лікарня».',
        'До кінця 1930-х років довжина трамвайних колій становила 41 км, місто обслуговували понад 70 одиниць рухомого складу. У 1939 році трамвай пустили на Водопій.',
        `Під час Другої світової війни та окупації Миколаєва нацистськими окупантами трамваї продовжили працювати. Відновили рух 9 жовтня 1942 року. Вагони виходили на лінії з 4:30 до 8:00 та з 17:00 до 20:00 за п'ятьма маршрутами. У перші дні роботи на лінії вийшли 12 вагонів.`,
        'Третього вересня 1944 року трамвай почав курсувати від парку Петровського (сучасний «Народний сад») до вулиці Херсонської (сучасний проспект Центральний). Наприкінці того ж року було відновлено роботу лінії від Яхт-клубу до Чорноморського суднобудівного заводу (ЧСЗ).',
    ],
    [
        `Через сім років після закінчення війни, 23 червня 1952 року, запустили трамвай на широкій колії. Нова лінія була відокремлена від основної трамвайної мережі, зв'язала район 6-ї Слобідської та селища Новий Водопій. Трамваї №6 курсували з шостої години ранку до першої години ночі. Пасажири їздили від Нового Водопою та робили пересадку в місці перетину вулиць 6-ї Слобідської та Чкалова на старі вузькоколійні маршрути трамваїв №4 і №5.`,
        `У місті існували два трамвайні парки з різними типами вагонів — вузькою та широкою колією, які були з'єднані між собою. Довжина трамвайних колій у місті становила 33,2 км.`,
        `Наприкінці 50-х років 20-го сторіччя будівництво нових ліній для вузькоколійного трамвая було припинено — пріоритетним напрямком робити став розвиток трамвая на широкій колії.`,
        `Протяжність трамвайних міських магістралей у 1958 році становила 46 км, а у 1960 — вже 64 км.`,
        `У грудні 1959 року трамвай знайшов свою нинішню кінцеву зупинку на Центральному колгоспному ринку.`,
        `З 1961 по 1972 роки в Миколаєві відбувся перехід на широку колію. За одинадцять років 33,5 км вузькоколійок переклали на стандартні 1524 мм.`,
        `Станом на 1970 рік протяжність усіх трамвайних ліній у Миколаєві становила 70 км, на яких працював 191 вагон.`,
        `У 1988 році підприємства міського електротранспорту об'єдналися і, відповідно, змінили нумерацію вагонів. Номер трамвая з тризначного став чотиризначним, де перша цифра говорила про приналежність до депо: 1 — перше депо, 2 — друге депо, 3 — тролейбусне депо.`,
    ],
    [
        `У 1985 протяжність рейкового полотна міста досягала 74 км. На лініях у ці роки працювали трамвайні потяги із двох і навіть трьох вагонів.`,
        `У 1990-х роках у Миколаєві, як і в багатьох господарствах електротранспорту України, пасажиропотоки на міському транспорті в середньому зменшилися на 25 відсотків. Залишились нереалізованими плани будівництва трамвайної лінії «Промзона — Широка Балка» по вулиці Космонавтів, від 7-ї Поздовжньої до проспекту Богоявленського.`,
        `Під час складних, в економічному плані, часів з 1992 до 2010 року в Миколаєві не ліквідували жодного трамвайного маршруту, не демонтували жодної ділянки рейкового полотна, що використовується у перевезенні пасажирів. У лютому 2011 року керівництво «Миколаївелектротранс» прийняло рішення про закриття депо №2.`,
        `У листопаді 2015 року маршрут №10 почав їздити з Широкої Балки до Промзони.`,
        `У перші дні початку повномасштабної російської агресії проти України рух трамваїв у Миколаєві зупинили. 28 лютого 2022 року відновили роботу маршрути №1, №3 та №6. Проїзд для всіх зробили безоплатним. 17 березня випуск на лінію становив 20 вагонів на маршрутах №1, №3 та №6. Інтервал руху складав 15-20 хвилин. 23 березня почав працювати маршрут №11, а з 22 квітня №7 та №10.`,

    ],
    [
        `З 20 жовтня 2022 року після масованих атак російських військ на енергетичну інфраструктуру України, в Миколаєві збільшили інтервали руху на всіх маршрутах електротранспорту.`,
        `Також з 2022 року і по сьогодні трамваї «Миколаївелектротранс» застосовуються для доставлення питної води містянам.`
    ]
];

const textTrolley = [
    [
        `Вперше про розбудову тролейбусної лінії у Миколаєві заговорили у грудні 1945 року. Проєктування лінії розпочали у 1952 році, а роботи з прокладання — у 1965 році. За два роки до міста прибули перші тролейбуси й розпочалась обкатка маршрутів.`
    ],
    [
        `Після урочистого відкриття тролейбусної лінії 29 жовтня 1967 року містом курсували десять тролейбусів. Вони перевозили пасажирів двома маршрутами — №1 від Залізничного вокзалу (Привокзальна площа — ред.) до вулиці 11-та Слобідська та №2 від Центрального ринку до вулиці 11-та Слобідська.`,
        `Після урочистого відкриття тролейбусної лінії 29 жовтня 1967 року містом курсували десять тролейбусів. Вони перевозили пасажирів двома маршрутами — №1 від Залізничного вокзалу (Привокзальна площа — ред.) до вулиці 11-та Слобідська та №2 від Центрального ринку до вулиці 11-та Слобідська.`,
    ],
    [
        `У серпні 1968 року відкрили тролейбусну лінію, яка зв'язала Залізничний вокзал з парком імені Петровського (зараз «Народний сад» — ред.), тролейбуси їхали вулицями Пушкінською та Великою Морською, так з'явився маршрут №3.`,
        `У грудні того ж 1968 року розпочалися роботи з прокладання тролейбусної лінії до мікрорайону Ліски. Нову ділянку протяжністю 6,5 кілометра закінчили будувати у вересні 1969 року. По новій лінії пустили маршрут № 4, який зв'язав Залізничний вокзал та мікрорайон Ліски, а також маршрут № 2 продовжили від Центрального ринку до Лісків.`,
        `Тролейбусне депо, на вулиці Будівельників, почали будувати у 1964 році. Завершили 5 березня 1970 року.`,
        `У травні 1969 року до депо пустили тролейбусні маршрути №1 та №2. У 1970 році збудували кільце для розвороту по вулицях Котельній та Володарського.`,
        `У 1970-ті роки тролейбусна мережа Миколаєва розвивалась у напрямку проспекту Миру.`,
        `27 липня 1974 року для пасажирського руху відкрили ділянку довжиною п’ять кілометрів, від кільця на перетині нинішніх проспекту Центрального та проспекту Богоявленського по проспекту Миру до станції Сортувальна, яким пішов маршрут № 1. У той же день був відкритий тролейбусний маршрут № 5 — «Мікрорайон Ліски — вулиця 3-тя Слобідська».`,
    ],
    [
        `Розвідний міст через річку Інгул, який запустили в експлуатацію 6 січня 1981 року, відкрив доступ електротранспорту в мікрорайон Соляні. У серпні 1981 року почалися роботи з прокладання нової лінії. Вже 31 грудня 1983 року тролейбуси пішли маршрутом №6 «Парк Петровського (нині «Народний сад» — ред.) — мікрорайон Соляні».`,
        `Мікрорайон Намив, у якому будували лише багатоповерхові будинки, почали приєднувати до міської тролейбусної мережі восени 1984 року. Особливість нової траси полягала у необхідності додаткового зміцнення опор контактної мережі через проходження лінії по намивній частині. Нову лінію відкрили напередодні 1986 року. Від Лісків на Намив продовжили маршрут №5.`,
    ],
    [
        `Наприкінці 1999 року на наявній контактній мережі організували проїзд тролейбусів від мікрорайону Ліски до Сільгосптехніки у Соляних, так з'явився маршрут №7.`
    ],
    [
        `У 80-х роках минулого сторіччя від Пушкінського кільця до мікрорайону Ліски працював маршрут №8. Тролейбуси виходили на лінію під час так званої «робочого перевезення». У 1998 році офіційно був закритий.`,
    ],
    [
        `Навесні 2001 року добудували та відкрили ділянку тролейбусної лінії від мікрорайону Північний до траси на проспекті Героїв України. По новій лінії пустили тролейбуси маршруту № 9 «Залізничний вокзал — мікрорайон Північний».`,
        `У середині жовтня 2001 року тролейбусні маршрути №1, №3 і №4 офіційно були закриті. Рухомий склад з закритих ліній розподілили між маршрутами, що залишились. Проте вже в листопаді 2014 року маршрут №4 був відновлений.`,
    ],
    [
        `15 листопада 2018 року розпочали будувати кільцеву тролейбусну лінію на Намиві. 17 липня 2020 року лінія була обкатана в тестовому режимі, а з 20 липня лінію відкрили для пасажирського руху. Довжина нової лінії склала 3,2 кілометра.`,
        `У 2021 році розпочали встановлювати опори контактної мережі для нової тролейбусної лінії від міжміського автовокзалу до кільця на вулиці Антонюка в Корабельному районі. Війна не дала завершити цю роботу.`,
    ],
    [
        `Також з 2022 року і по сьогодні  тролейбуси «Миколаївелектротранс» застосовуються для доставлення питної води містянам.`
    ]
]

export default function Page() {

    return(
        <div className='flex flex-col min-h-screen text-black justify-start items-cente w-full bg-white p-5 pt-0 lg:pt-0 lg:p-20 gap-5 lg:gap-10 text-xs lg:text-base text-justify'>
            <div>
                <BlackTitle text={'Історія підприємства '}/>
            </div>
            <div className='flex flex-col gap-5 lg:gap-10'>
                <div className='relative p-5 lg:px-20 border-2 border-[#008DD2] rounded-xl w-full h-full flex flex-col gap-5 lg:gap-10'>
                    <div className=' p-2 bg-white absolute -top-4 lg:-top-5'>
                        <h1 className='uppercase text-[#008DD2] font-black'>Історія трамвайних маршрутів</h1>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTram[0].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    <div className=''>
                        <ImageCard image={pic1} description={'Перетин сучасних вулиці Соборної та проспекту Центрального. По центру будівля електропідстанції. Фото: Миколаївський обласний архів'}/>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTram[1].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    <div className=''>
                        <ImageCard image={pic2} description={'Один з перших миколаївських трамваїв. Фото: Миколаївській обласний архів'}/>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTram[2].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    <div className=''>
                        <ImageCard image={pic3} description={'Трамваї на Соборній вулиці, 1952 рік. Фото: Миколаївський обласний архів'}/>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTram[3].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    <div className=''>
                        <ImageCard image={pic4} description={'Трамвай маршруту №1 біля Яхт-Клубу. Фото: Архів КП «Миколаївелектротранс»'}/>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTram[4].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    <div className=''>
                        <ImageCard image={pic5} description={'Доставка питної води трамваєм. Миколаїв, літо 2022 року. Фото: «Миколаївелектротранс»'}/>
                    </div>
                    <div className=''>
                        <ImageCard image={pic6} description={'Доставка питної води трамваєм. Миколаїв, літо 2023 року. Фото: «Миколаївелектротранс»'}/>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTram[5].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                </div>


 {/* block about history of Trolleybus*/}

                <div className='relative p-5 lg:px-20 border-2 border-[#008DD2] rounded-xl w-full h-full flex flex-col gap-5 lg:gap-10'>
                    <div className=' p-2 bg-white absolute -top-4 lg:-top-5'>
                        <h1 className='uppercase text-[#008DD2] font-black'>Історія тролейбусних маршрутів</h1>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTrolley[0].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    <div className=''>
                        <ImageCard image={picTralley1} description={'Привокзальна площа в Миколаєві. 29 жовтня 1967 року. Фото: bazar.nikolaev.ua'}/>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTrolley[1].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    <div className=''>
                        <ImageCard image={picTralley2} description={'Тролейбус «Київ-4» на маршруті №1. 1968 рік. Фото: Державний архів Миколаївської області'}/>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTrolley[2].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    <div className=''>
                        <ImageCard image={picTralley3} description={'Тролейбус на маршруті №6 2022 рік. Фото: Архів КП «Миколаївелектротранс»'}/>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTrolley[3].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    <div className=''>
                        <ImageCard image={picTralley4} description={'Схема тролейбусних маршрутів у Миколаєві станом на 1989 рік. Фото: Архів КП «Миколаївелектротранс»'}/>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTrolley[4].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    <div className=''>
                        <ImageCard image={picTralley5} description={`Тролейбуси маршруту №7 з'єднують два спальні райони Миколаєва (Намив - Північний). Фото: Архів КП «Миколаївелектротранс»`}/>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTrolley[5].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    <div className=''>
                        <ImageCard image={picTralley6} description={`Маршрут №9 дозволяє доїхати з Північного до Залізничного вокзалу без пересадок. Фото: Архів КП «Миколаївелектротранс»`}/>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTrolley[6].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    <div className=''>
                        <ImageCard image={picTralley7} description={`Тролейбус на кільцевій дорозі у мікрорайоні Намив. Фото: Архів КП «Миколаївелектротранс»`}/>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTrolley[7].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    <div className=''>
                        <ImageCard image={picTralley8} description={`Доставка питної води тролейбусом. Миколаїв, літо 2024 року. Фото: КП «Миколаївелектротранс»`}/>
                    </div>
                    <div className='flex pt-0 lg:pt-5 flex-col gap-2 lg:gap-5'>
                        {textTrolley[8].map((item, index) => (
                            <p key={index}>{item}</p>
                        ))}
                    </div>
                    
                </div>
                <div className=''>
                        <h1 className='uppercase text-[#008DD2] font-black'>За матеріалами СУСПІЛЬНЕ МИКОЛАЇВ</h1>
                </div>
            </div>
        </div>
    )
}