export default function AboutText() {
    const aboutTetxtArr = [
        'КП ММР «МИКОЛАЇВЕЛЕКТРОТРАНС» - комунальне підприємство засноване Миколаївською міською радою для здійснення перевезення пасажирів міським електротранспортом.',
        'До складу підприємства входять 1 тролейбусне та 1 трамвайне депо з технологічним обладнанням, вагоно-ремонтна майстерня, служба енергогосподарства, будівельно-ремонтна служба, служба експлуатації, служба колії, служба руху.',
        'Сьогодні ми обслуговуємо 6 тролейбусних та 6 трамвайних маршрутів, якими щоденно користуються десятки тисяч пасажирів.'
    ]
    return(
        <div className="flex flex-col tracking-tight font-normal gap-5 lg:gap-10 px-3 md:px-20 lg:px-32 justify-center text-justify text-xs lg:text-base">
            {aboutTetxtArr.map((item, index) => (
                <p key={index}>
                    {item}
                </p>
            ))}
            
        </div>
    )
}